ams/src/Documents/РаспознанныйДокумент/РаспознанныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспознанныйДокумент</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентБРД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБРД</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовРаспознаваниеДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСозданныхДокументовРаспознаваниеДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходноеИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Миниатюра</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>EnumRef.ИсточникиПолученияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияРаспознанногоДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Содержит текст ошибки от пользователя или информацию, которую он хочет передать разработчикам сервиса</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеПриложение</name>
    <type>
      <types>CatalogRef.МобильныеПриложенияРаспознаванияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбработки</name>
    <type>
      <types>EnumRef.ВариантыОбработкиЗаданияРаспознавания</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРаспознанныхСущностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыДокумента</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.РаспознаваемыеРеквизитыДокументаБРД</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненоВручную</name>
      <comment>Значение было выбрано пользователем</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НайденноеЗначение</name>
      <type>
        <types>DefinedType.РаспознаваемыеРеквизитыДокументаБРД</types>
      </type>
    </attributes>
    <attributes>
      <name>УверенностьНайденногоЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаспознанныйТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбластьИзображения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокВИзображении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаX0</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаY0</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаX1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаY1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементСоздан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыТабличныхЧастей</name>
    <attributes>
      <name>ТабличнаяЧасть</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТЧ</name>
      <comment>Это КлючСтроки. Всегда > 0</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.РаспознаваемыеРеквизитыДокументаБРД</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненоВручную</name>
      <comment>Значение было выбрано пользователем</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаУдалена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НайденноеЗначение</name>
      <type>
        <types>DefinedType.РаспознаваемыеРеквизитыДокументаБРД</types>
      </type>
    </attributes>
    <attributes>
      <name>УверенностьНайденногоЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаспознанныйТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбластьИзображения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокВИзображении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаX0</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаY0</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаX1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаY1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокСтроки</name>
      <comment>Порядок строки на форме. Всегда > 0</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементСоздан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПометкиНаДокументе</name>
    <attributes>
      <name>ТипПометки</name>
      <type>
        <types>EnumRef.ТипыПометокРаспознанногоДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбластьИзображения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаX0</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаY0</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаX1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатаY1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснованияКорректировки</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ДокументОснованиеКорректировкиБРД</types>
      </type>
    </attributes>
    <attributes>
      <name>РаспознанныйТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/CommonModules/РаспознаваниеДокументовСлужебныйКлиентПовтИсп/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПеречисленияТипВсеСсылки() Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПеречисленияТипВсеСсылки();
	
КонецФункции

Функция ПолучитьИмяОткрываемойФормыПоТипу(ТипДокумента, ВариантОбработки) Экспорт
	
	Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.ТОРГ12")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура") Тогда
		
		ИмяФормы = "Обработка.ТОРГ12РаспознаваниеДокументов.Форма";
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату") Тогда
		ИмяФормы = "Обработка.СчетНаОплатуРаспознаваниеДокументов.Форма";
	Иначе
		
		Если ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.ПоступлениеТоваров")
			Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.РеализацияТоваров") Тогда 
			
			ИмяФормы = "Обработка.ТОРГ12РаспознаваниеДокументов.Форма";
			
		ИначеЕсли ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуПоставщика")
			Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуКлиента") Тогда
			
			ИмяФормы = "Обработка.СчетНаОплатуРаспознаваниеДокументов.Форма";
		Иначе
			ИмяФормы = "Документ.РаспознанныйДокумент.Форма.ФормаНеопределенногоДокумента";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяФормы;
	
КонецФункции

Функция ТипДокументаПоВариантуОбработки(ВариантОбработки) Экспорт
	
	Если ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуКлиента")
		Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуПоставщика") Тогда 
		
		ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату");
		
	Иначе
		ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.НеопределенныйДокумент");
	КонецЕсли;
	
	Возврат ТипДокумента;
	
КонецФункции

Функция НаправлениеПоВариантуОбработки(ВариантОбработки) Экспорт
	
	Если ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.ПоступлениеТоваров")
		Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуПоставщика") Тогда 
		
		Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий");
		
	ИначеЕсли ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.РеализацияТоваров")
		Или ВариантОбработки = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуКлиента") Тогда
		
		Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий");
	Иначе
		Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий");
	КонецЕсли;
	
	Возврат Направление;
	
КонецФункции

Функция ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2 = Ложь) Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2);
	
КонецФункции   

// Возвращает типы, соответствующие указанному имени определяемого типа.
//
// Параметры:
//   ИмяОпределяемогоТипа - Строка - имя определяемого типа
//
// Возвращаемое значение:
//   Массив - из Тип
Функция ТипыПоИмениОпределяемогоТипа(ИмяОпределяемогоТипа) Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ТипыПоИмениОпределяемогоТипа(ИмяОпределяемогоТипа);
	
КонецФункции

// Проверяет, содержит ли проверяемое значение тип, определяемый по имени.
//
// Параметры:
//   ИмяОпределяемогоТипа  - Строка - имя определяемого типа
//   ПроверяемоеЗначение   - СправочникСсылка
//
// Возвращаемое значение:
//   Булево - содержит ли проверяемое значение указанный тип
Функция СодержитТипПоИмениОпределяемогоТипа(ИмяОпределяемогоТипа, ПроверяемоеЗначение) Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.СодержитТипПоИмениОпределяемогоТипа(
		ИмяОпределяемогоТипа, ПроверяемоеЗначение);
	
КонецФункции

#КонецОбласти
